system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rbgh
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.0001;
        smoother        DIC;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    p_rbghFinal
    {
        $p_rbgh;
        tolerance       1e-6;
        relTol          0;
    }

    "(k.b|epsilon.b|pa_new_value|alphaPlastic)"
    {
	solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-5;
        relTol          0;


/*
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-15;
        relTol          0;
*/
    }
    
    omega.b
    {	
	solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0;

    }

    "(k.bFinal|epsilon.bFinal|paFinal|alphaPlasticFinal)"
    {
       solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-5;
        relTol          0;

    }

    omega.bFinal
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0;

    }

    "U.a|U.aFinal"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
    }

    "U.b|U.bFinal"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
    }

    alpha.a
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0;
    }
    alpha.aFinal
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0;
    }
    Theta
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0;
    }
    ThetaFinal
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0;
    }
}


relaxationFactors
{
    fields
    {
        pa              1.;
    }
}

PIMPLE
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 1;
    nAlphaCorr      1;
    correctAlpha    yes;
    pRefPoint       (0.9999 0.2049 0.0);
    //pRefCell       0;
    pRefValue       0;
}

// ************************************************************************* //
